---
kind: method
id: M:Autodesk.Revit.DB.GuidEnum.GetHashCode
source: html/ac66f072-e558-0e10-b7ed-4cec874b0e0d.htm
---
# Autodesk.Revit.DB.GuidEnum.GetHashCode Method

Generates a hash code for this Guid-based enum object.

## Syntax (C#)
```csharp
public override int GetHashCode()
```